# Intro to Pandas

In [10]:
import pandas as pd

## Series(data sturcture)

In [ ]:
a=pd.Series([1,2,3,4,5])
print(a)
# series is the labeled array

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
b=pd.Series([1,2,3,4,5],index=['a','b','c','d','e',])
print(b)

a    1
b    2
c    3
d    4
e    5
dtype: int64

## Data Frames (data structure)

In [ ]:
#dataframes are two dimensional data structure
df=pd.DataFrame({"names":["shayan","aliyan","shaheer"],"marks":[10,33,44]})
print(df)

     names  marks
0   shayan     10
1   aliyan     33
2  shaheer     44

In [11]:
df=pd.read_csv("customers_data.csv")

In [12]:
print(df)

    Index      Customer Id First Name Last Name  \
0       1  DD37Cf93aecA6Dc     Sheryl    Baxter
1       2  1Ef7b82A4CAAD10    Preston    Lozano
2       3  6F94879bDAfE5a6        Roy     Berry
3       4  5Cef8BFA16c5e3c      Linda     Olsen
4       5  053d585Ab6b3159     Joanna    Bender
..    ...              ...        ...       ...
95     96  cb8E23e48d22Eae       Karl     Greer
96     97  CeD220bdAaCfaDf       Lynn  Atkinson
97     98  28CDbC0dFe4b1Db       Fred    Guerra
98     99  c23d1D9EE8DEB0A     Yvonne    Farmer
99    100  2354a0E336A91A1   Clarence    Haynes

                            Company               City  \
0                   Rasmussen Group       East Leonard
1                       Vega-Gentry  East Jimmychester
2                     Murillo-Perry      Isabelborough
3   Dominguez, Mcmillan and Donovan         Bensonview
4          Martin, Lang and Andrade     West Priscilla
..                              ...                ...
95                        Carey LLC       East Richard
96            Ware, Burns and Oneal       New Bradview
97                    Schmitt-Jones         Ortegaland
98               Fitzgerald-Harrell    Lake Elijahview
99               Le, Nash and Cross          Judymouth

                       Country                 Phone 1  \
0                        Chile            229.077.5154
1                     Djibouti              5153435776
2          Antigua and Barbuda                   -1199
3           Dominican Republic  001-808-617-6467x12895
4   Slovakia (Slovak Republic)  001-234-203-0635x76146
..                         ...                     ...
95                      Guyana     (188)169-1674x58692
96                   Sri Lanka                   -3769
97             Solomon Islands    +1-753-067-8419x7170
98                       Aruba           (530)311-9786
99                    Honduras           (753)813-6941

                             Email
0         zunigavanessa@smith.info
1                  vmata@colon.com
2              beckycarr@hogan.com
3      stanleyblackwell@benson.org
4          colinalvarado@miles.net
..                             ...
95                hhart@jensen.com
96               vkemp@ferrell.com
97                swagner@kane.org
98  mccarthystephen@horn-green.biz
99          colleen91@faulkner.biz

[100 rows x 9 columns]

In [13]:
df.head()

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Email
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,zunigavanessa@smith.info
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,vmata@colon.com
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,-1199,beckycarr@hogan.com
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,stanleyblackwell@benson.org
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,colinalvarado@miles.net

In [14]:
df.tail()

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Email
95,96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,hhart@jensen.com
96,97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,-3769,vkemp@ferrell.com
97,98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,swagner@kane.org
98,99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,mccarthystephen@horn-green.biz
99,100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,colleen91@faulkner.biz

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Index        100 non-null    int64
 1   Customer Id  100 non-null    object
 2   First Name   100 non-null    object
 3   Last Name    100 non-null    object
 4   Company      100 non-null    object
 5   City         100 non-null    object
 6   Country      100 non-null    object
 7   Phone 1      100 non-null    object
 8   Email        100 non-null    object
dtypes: int64(1), object(8)
memory usage: 7.2+ KB

In [16]:
df.describe()

            Index
count  100.000000
mean    50.500000
std     29.011492
min      1.000000
25%     25.750000
50%     50.500000
75%     75.250000
max    100.000000

## data selection

In [17]:
df['Customer Id']

0     DD37Cf93aecA6Dc
1     1Ef7b82A4CAAD10
2     6F94879bDAfE5a6
3     5Cef8BFA16c5e3c
4     053d585Ab6b3159
           ...
95    cb8E23e48d22Eae
96    CeD220bdAaCfaDf
97    28CDbC0dFe4b1Db
98    c23d1D9EE8DEB0A
99    2354a0E336A91A1
Name: Customer Id, Length: 100, dtype: object

In [24]:
df[['Customer Id','Company','Phone 1']]

        Customer Id                          Company                 Phone 1
0   DD37Cf93aecA6Dc                  Rasmussen Group            229.077.5154
1   1Ef7b82A4CAAD10                      Vega-Gentry              5153435776
2   6F94879bDAfE5a6                    Murillo-Perry                   -1199
3   5Cef8BFA16c5e3c  Dominguez, Mcmillan and Donovan  001-808-617-6467x12895
4   053d585Ab6b3159         Martin, Lang and Andrade  001-234-203-0635x76146
..              ...                              ...                     ...
95  cb8E23e48d22Eae                        Carey LLC     (188)169-1674x58692
96  CeD220bdAaCfaDf            Ware, Burns and Oneal                   -3769
97  28CDbC0dFe4b1Db                    Schmitt-Jones    +1-753-067-8419x7170
98  c23d1D9EE8DEB0A               Fitzgerald-Harrell           (530)311-9786
99  2354a0E336A91A1               Le, Nash and Cross           (753)813-6941

[100 rows x 3 columns]

In [25]:
df.iloc[0]

Index                                 1
Customer Id             DD37Cf93aecA6Dc
First Name                       Sheryl
Last Name                        Baxter
Company                 Rasmussen Group
City                       East Leonard
Country                           Chile
Phone 1                    229.077.5154
Email          zunigavanessa@smith.info
Name: 0, dtype: object

In [27]:
df2=pd.read_csv("10customers_data.csv")

In [28]:
df2.head()

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Email
0,1.0,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,zunigavanessa@smith.info
1,2.0,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,NaN,Djibouti,5153435776,vmata@colon.com
2,3.0,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,-1199,beckycarr@hogan.com
3,4.0,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,NaN
4,5.0,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,colinalvarado@miles.net

In [29]:
df2.dropna()

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Email
0,1.0,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,zunigavanessa@smith.info
2,3.0,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,-1199,beckycarr@hogan.com
4,5.0,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,colinalvarado@miles.net
6,7.0,EA4d384DfDbBf77,Darren,Peck,"Lester, Woodard and Mitchell",Lake Ana,Pitcairn Islands,(496)452-6181x3291,tgates@cantrell.com
7,8.0,0e04AFde9f225dE,Brett,Mullen,"Sanford, Davenport and Giles",Kimport,Bulgaria,001-583-352-7197x297,asnow@colon.com

In [30]:
df2.fillna(0)

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Email
0,1.0,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,zunigavanessa@smith.info
1,2.0,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,0,Djibouti,5153435776,vmata@colon.com
2,3.0,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,-1199,beckycarr@hogan.com
3,4.0,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,0
4,5.0,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,colinalvarado@miles.net
5,6.0,2d08FB17EE273F4,Aimee,0,Steele Group,Chavezborough,Bosnia and Herzegovina,(283)437-3886x88321,louis27@gilbert.com
6,7.0,EA4d384DfDbBf77,Darren,Peck,"Lester, Woodard and Mitchell",Lake Ana,Pitcairn Islands,(496)452-6181x3291,tgates@cantrell.com
7,8.0,0e04AFde9f225dE,Brett,Mullen,"Sanford, Davenport and Giles",Kimport,Bulgaria,001-583-352-7197x297,asnow@colon.com
8,9.0,0,Sheryl,Meyers,Browning-Simon,Robersonstad,Cyprus,854-138-4911x5772,mariokhan@ryan-pope.org
9,0.0,0,0,0,0,0,0,0,0
10,0.0,0,0,0,0,0,0,0,0
11,0.0,0,0,0,0,0,0,0,0
12,0.0,0,0,0,0,0,0,0,0
13,0.0,0,0,0,0,0,0,0,0
14,0.0,0,0,0,0,0,0,0,0
15,0.0,0,0,0,0,0,0,0,0
16,0.0,0,0,0,0,0,0,0,0
17,0.0,0,0,0,0,0,0,0,0
18,0.0,0,0,0,0,0,0,0,0
19,0.0,0,0,0,0,0,0,0,0
20,0.0,0,0,0,0,0,0,0,0
21,0.0,0,0,0,0,0,0,0,0
22,0.0,0,0,0,0,0,0,0,0
23,0.0,0,0,0,0,0,0,0,0
24,0.0,0,0,0,0,0,0,0,0
25,0.0,0,0,0,0,0,0,0,0
26,0.0,0,0,0,0,0,0,0,0
27,0.0,0,0,0,0,0,0,0,0
28,0.0,0,0,0,0,0,0,0,0
29,0.0,0,0,0,0,0,0,0,0
30,0.0,0,0,0,0,0,0,0,0
31,0.0,0,0,0,0,0,0,0,0
32,0.0,0,0,0,0,0,0,0,0
33,0.0,0,0,0,0,0,0,0,0
34,0.0,0,0,0,0,0,0,0,0
35,0.0,0,0,0,0,0,0,0,0
36,0.0,0,0,0,0,0,0,0,0
37,0.0,0,0,0,0,0,0,0,0
38,0.0,0,0,0,0,0,0,0,0
39,0.0,0,0,0,0,0,0,0,0
40,0.0,0,0,0,0,0,0,0,0
41,0.0,0,0,0,0,0,0,0,0
42,0.0,0,0,0,0,0,0,0,0

In [32]:
df.rename(columns={"Customer Id":"Id"})

,Index,Id,First Name,Last Name,Company,City,Country,Phone 1,Email
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,zunigavanessa@smith.info
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,vmata@colon.com
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,-1199,beckycarr@hogan.com
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,stanleyblackwell@benson.org
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,colinalvarado@miles.net
...,...,...,...,...,...,...,...,...,...
95,96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,hhart@jensen.com
96,97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,-3769,vkemp@ferrell.com
97,98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,swagner@kane.org
98,99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,mccarthystephen@horn-green.biz
99,100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,colleen91@faulkner.biz

In [33]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43 entries, 0 to 42
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Index        9 non-null      float64
 1   Customer Id  8 non-null      object
 2   First Name   9 non-null      object
 3   Last Name    8 non-null      object
 4   Company      9 non-null      object
 5   City         8 non-null      object
 6   Country      9 non-null      object
 7   Phone 1      9 non-null      object
 8   Email        8 non-null      object
dtypes: float64(1), object(8)
memory usage: 3.2+ KB

In [41]:
df2['Customer Id']=df2['Customer Id'].astype("string") # to change the data type

In [42]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43 entries, 0 to 42
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Index        9 non-null      float64
 1   Customer Id  43 non-null     string
 2   First Name   9 non-null      object
 3   Last Name    8 non-null      object
 4   Company      9 non-null      object
 5   City         8 non-null      object
 6   Country      9 non-null      object
 7   Phone 1      9 non-null      object
 8   Email        8 non-null      object
dtypes: float64(1), object(7), string(1)
memory usage: 3.2+ KB

In [43]:
len(df2)

43

In [48]:
df2["zeros"]=[4 for i in range(len(df2))]

In [49]:
df2.head()

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Email,zeros
0,1.0,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,zunigavanessa@smith.info,4
1,2.0,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,NaN,Djibouti,5153435776,vmata@colon.com,4
2,3.0,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,-1199,beckycarr@hogan.com,4
3,4.0,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,NaN,4
4,5.0,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,colinalvarado@miles.net,4

In [50]:
def fx(a):
    return a*a
df2["zeros + 1"]=df2["zeros"].apply(fx)

In [52]:
df2.head()

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Email,zeros,zeros + 1
0,1.0,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,zunigavanessa@smith.info,4,16
1,2.0,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,NaN,Djibouti,5153435776,vmata@colon.com,4,16
2,3.0,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,-1199,beckycarr@hogan.com,4,16
3,4.0,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,NaN,4,16
4,5.0,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,colinalvarado@miles.net,4,16

In [53]:
df2.to_csv("export.csv",index=False)

In [55]:
df3=pd.DataFrame({"names":["haris","hasssan","naeem"],"marks":[104,3,14]})
df3.head()

     names  marks
0    haris    104
1  hasssan      3
2    naeem     14

In [58]:
df4=pd.DataFrame({"names":["aa","san","nae"],"marks":[14,344,144]})
df4.head()

  names  marks
0    aa     14
1   san    344
2   nae    144

In [61]:
df5=pd.concat([df3,df4])
df5

     names  marks
0    haris    104
1  hasssan      3
2    naeem     14
0       aa     14
1      san    344
2      nae    144

In [63]:
df6=pd.DataFrame({"names":["haris","hasssan","naeem"],"Roll no":[1024,1025,1026]})
df6

     names  Roll no
0    haris     1024
1  hasssan     1025
2    naeem     1026

In [67]:
df7=pd.merge(df3,df6,on="names")
df7

     names  marks  Roll no
0    haris    104     1024
1  hasssan      3     1025
2    naeem     14     1026